Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_gc01_cult/pic32ck_gc01_cult_getting_started/firmware/src/packs/PIC32CK2051GC01144_DFP/component/idau.h
/* -------- IDAU_STATUSA : (IDAU Offset: 0x04) ( R/ 32) Status A -------- */
#define IDAU_STATUSA_ENABLE_Pos               _UINT32_(0)                                          /* (IDAU_STATUSA) Enable Position */
#define IDAU_STATUSA_ENABLE_Msk               (_UINT32_(0x1) << IDAU_STATUSA_ENABLE_Pos)           /* (IDAU_STATUSA) Enable Mask */
#define IDAU_STATUSA_ENABLE(value)            (IDAU_STATUSA_ENABLE_Msk & (_UINT32_(value) << IDAU_STATUSA_ENABLE_Pos)) /* Assigment of value for ENABLE in the IDAU_STATUSA register */
#define IDAU_STATUSA_WLCK_Pos                 _UINT32_(1)                                          /* (IDAU_STATUSA) Write Lock Position */
#define IDAU_STATUSA_WLCK_Msk                 (_UINT32_(0x1) << IDAU_STATUSA_WLCK_Pos)             /* (IDAU_STATUSA) Write Lock Mask */
#define IDAU_STATUSA_WLCK(value)              (IDAU_STATUSA_WLCK_Msk & (_UINT32_(value) << IDAU_STATUSA_WLCK_Pos)) /* Assigment of value for WLCK in the IDAU_STATUSA register */
#define IDAU_STATUSA_NBRG_Pos                 _UINT32_(8)                                          /* (IDAU_STATUSA) Number Of IDAU Regions Position */
#define IDAU_STATUSA_NBRG_Msk                 (_UINT32_(0x1FF) << IDAU_STATUSA_NBRG_Pos)           /* (IDAU_STATUSA) Number Of IDAU Regions Mask */
#define IDAU_STATUSA_NBRG(value)              (IDAU_STATUSA_NBRG_Msk & (_UINT32_(value) << IDAU_STATUSA_NBRG_Pos)) /* Assigment of value for NBRG in the IDAU_STATUSA register */
#define IDAU_STATUSA_Msk                      _UINT32_(0x0001FF03)                                 /* (IDAU_STATUSA) Register Mask  */


/* -------- IDAU_STATUSB : (IDAU Offset: 0x08) (R/W 32) Status B -------- */
#define IDAU_STATUSB_RESETVALUE               _UINT32_(0x00)                                       /*  (IDAU_STATUSB) Status B  Reset Value */

#define IDAU_STATUSB_CFGERR_Pos               _UINT32_(0)                                          /* (IDAU_STATUSB) Configuration Error Position */
#define IDAU_STATUSB_CFGERR_Msk               (_UINT32_(0x1) << IDAU_STATUSB_CFGERR_Pos)           /* (IDAU_STATUSB) Configuration Error Mask */
#define IDAU_STATUSB_CFGERR(value)            (IDAU_STATUSB_CFGERR_Msk & (_UINT32_(value) << IDAU_STATUSB_CFGERR_Pos)) /* Assigment of value for CFGERR in the IDAU_STATUSB register */
#define IDAU_STATUSB_Msk                      _UINT32_(0x00000001)                                 /* (IDAU_STATUSB) Register Mask  */


/** \brief IDAU register offsets definitions */
#define IDAU_RCTRL_REG_OFST            _UINT32_(0x00)      /* (IDAU_RCTRL) Region Control Offset */
#define IDAU_RSTATUSA_REG_OFST         _UINT32_(0x04)      /* (IDAU_RSTATUSA) Region Status A Offset */
#define IDAU_RSTATUSB_REG_OFST         _UINT32_(0x08)      /* (IDAU_RSTATUSB) Region Status B Offset */
#define IDAU_RSTATUSC_REG_OFST         _UINT32_(0x0C)      /* (IDAU_RSTATUSC) Region Status C Offset */
#define IDAU_CTRL_REG_OFST             _UINT32_(0x00)      /* (IDAU_CTRL) Control Offset */
#define IDAU_STATUSA_REG_OFST          _UINT32_(0x04)      /* (IDAU_STATUSA) Status A Offset */
#define IDAU_STATUSB_REG_OFST          _UINT32_(0x08)      /* (IDAU_STATUSB) Status B Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief REGIONS register API structure */
typedef struct
{
  __O   uint32_t                       IDAU_RCTRL;         /**< Offset: 0x00 ( /W  32) Region Control */
  __I   uint32_t                       IDAU_RSTATUSA;      /**< Offset: 0x04 (R/   32) Region Status A */
  __I   uint32_t                       IDAU_RSTATUSB;      /**< Offset: 0x08 (R/   32) Region Status B */
  __I   uint32_t                       IDAU_RSTATUSC;      /**< Offset: 0x0C (R/   32) Region Status C */
} idau_regions_registers_t;

#define IDAU_REGIONS_NUMBER 24

/** \brief IDAU register API structure */
typedef struct
{  /* Implementation Defined Attribution Unit */
  __O   uint32_t                       IDAU_CTRL;          /**< Offset: 0x00 ( /W  32) Control */
  __I   uint32_t                       IDAU_STATUSA;       /**< Offset: 0x04 (R/   32) Status A */
  __IO  uint32_t                       IDAU_STATUSB;       /**< Offset: 0x08 (R/W  32) Status B */
  __I   uint8_t                        Reserved1[0xFF4];
        idau_regions_registers_t       REGIONS[IDAU_REGIONS_NUMBER]; /**< Offset: 0x1000  */
} idau_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CKGC01_IDAU_COMPONENT_H_ */
